MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/inc/hc32f46x_can.h
/*****************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_can.h
 **
 ** A detailed description is available at
 ** @link CanGroup CAN description @endlink
 **
 **   - 2018-11-27  1.0  Lux First version for Device Driver Library of CAN
 **
 ******************************************************************************/
#ifndef __HC32F46X_CAN_H__
#define __HC32F46X_CAN_H__

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

#if (DDL_CAN_ENABLE == DDL_ON)

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

    /**
     *******************************************************************************
     ** \defgroup CanGroup Controller Area Network(CAN)
     **
     ******************************************************************************/
    //@{

    /*******************************************************************************
     * Global type definitions ('typedef')
     ******************************************************************************/

    /**
     *******************************************************************************
     ** \brief  The Can error types.
     ******************************************************************************/
    typedef enum
    {
        NO_ERROR = 0U,
        BIT_ERROR = 1U,
        FORM_ERROR = 2U,
        STUFF_ERROR = 3U,
        ACK_ERROR = 4U,
        CRC_ERROR = 5U,
        UNKOWN_ERROR = 6U,
    } en_can_error_t;

    /**
     *******************************************************************************
     ** \brief  The Can transmit buffer select.(TCMD)
     ******************************************************************************/
    typedef enum
    {
        CanPTBSel = 0U, ///< high-priority buffer
        CanSTBSel = 1U, ///< secondary buffer
    } en_can_buffer_sel_t;

    /**
     *******************************************************************************
     ** \brief  The Can warning limits.(AFWL)
     ******************************************************************************/
    typedef struct stc_can_warning_limit
    {
        uint8_t CanWarningLimitVal;      ///< Receive buffer almost full warning limit
        uint8_t CanErrorWarningLimitVal; ///< Programmable error warning limit
    } stc_can_warning_limit_t;

    /**
     *******************************************************************************
     ** \brief  The Acceptance Filters Frame Format Check.(ACF)
     ******************************************************************************/
    typedef enum en_can_acf_format_en
    {
        CanStdFrames = 0x02u, ///< Accepts only Standard frames
        CanExtFrames = 0x03u, ///< Accepts only Extended frames
        CanAllFrames = 0x00u, ///< Accepts both standard or extended frames
    } en_can_acf_format_en_t;

    /**
     *******************************************************************************
     ** \brief  The Acceptance Filters Enable.(ACFEN)
     ******************************************************************************/
    typedef enum en_can_filter_sel
    {
        CanFilterSel1 = 0u, ///< The Acceptance Filter 1 Enable
        CanFilterSel2 = 1u, ///< The Acceptance Filter 2 Enable
        CanFilterSel3 = 2u, ///< The Acceptance Filter 3 Enable
        CanFilterSel4 = 3u, ///< The Acceptance Filter 4 Enable
        CanFilterSel5 = 4u, ///< The Acceptance Filter 5 Enable
        CanFilterSel6 = 5u, ///< The Acceptance Filter 6 Enable
        CanFilterSel7 = 6u, ///< The Acceptance Filter 7 Enable
        CanFilterSel8 = 7u, ///< The Acceptance Filter 8 Enable
    } en_can_filter_sel_t;

    /**
     *******************************************************************************
     ** \brief  The can interrupt enable.(IE)
     ******************************************************************************/
    typedef enum
    {
        //<<Can Rx or Tx Irq En
        CanRxIrqEn = 0x00000080,              ///< Receive interrupt enable
        CanRxOverIrqEn = 0x00000040,          ///< RB overrun interrupt enable
        CanRxBufFullIrqEn = 0x00000020,       ///< RB full interrupt enable
        CanRxBufAlmostFullIrqEn = 0x00000010, ///< RB almost full interrupt enable
        CanTxPrimaryIrqEn = 0x00000008,       ///< Transmission primary interrupt enable
        CanTxSecondaryIrqEn = 0x00000004,     ///< Transmission secondary enable
        CanErrorIrqEn = 0x00000002,           ///< Error interrupt enable

