MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/inc/hc32f46x_can.h
    typedef enum
    {
        CanTTcanWdtTriggerIrq = 0x80, ///< Watch trigger interrupt
        CanTTcanTimTriggerIrq = 0x10, ///< Time trigger interrupt
    } en_can_ttcan_irq_type_t;

    typedef struct stc_can_ttcan_ref_msg
    {
        uint8_t u8IDE; ///< Reference message IDE:1-Extended; 0-Standard;
        union          ///< Reference message ID
        {
            uint32_t RefStdID; ///< Reference standard ID
            uint32_t RefExtID; ///< Reference Extended ID
        };
    } stc_can_ttcan_ref_msg_t;

    typedef struct stc_can_ttcan_trigger_config
    {
        en_can_ttcan_tbslot_t enTbSlot;         ///< Transmit trigger TB slot pointer
        en_can_ttcan_trigger_type_t enTrigType; ///< Trigger type
        en_can_ttcan_Tpresc_t enTpresc;         ///< Timer prescaler
        uint8_t u8Tew;                          ///< Transmit enable window
        uint16_t u16TrigTime;                   ///< TTCAN trigger time
        uint16_t u16WatchTrigTime;              ///< TTCAN watch trigger time register
    } stc_can_ttcan_trigger_config_t;

    /*******************************************************************************
     * Global pre-processor symbols/macros ('#define')
     ******************************************************************************/

    /*******************************************************************************
     * Global variable definitions ('extern')
     ******************************************************************************/

    /*******************************************************************************
     * Global function prototypes (definition in C source)
     ******************************************************************************/
    void CAN_Init(stc_can_init_config_t *pstcCanInitCfg);
    void CAN_DeInit(void);
    void CAN_IrqCmd(en_can_irq_type_t enCanIrqType, en_functional_state_t enNewState);
    bool CAN_IrqFlgGet(en_can_irq_flag_type_t enCanIrqFlgType);
    void CAN_IrqFlgClr(en_can_irq_flag_type_t enCanIrqFlgType);
    void CAN_ModeConfig(en_can_mode_t enMode, en_functional_state_t enNewState);
    en_can_error_t CAN_ErrorStatusGet(void);
    bool CAN_StatusGet(en_can_status_t enCanStatus);

    void CAN_FilterConfig(const stc_can_filter_t *pstcFilter, en_functional_state_t enNewState);
    void CAN_SetFrame(stc_can_txframe_t *pstcTxFrame);
    en_can_tx_buf_status_t CAN_TransmitCmd(en_can_tx_cmd_t enTxCmd);
    en_can_rx_buf_status_t CAN_Receive(stc_can_rxframe_t *pstcRxFrame);

    uint8_t CAN_ArbitrationLostCap(void);
    uint8_t CAN_RxErrorCntGet(void);
    uint8_t CAN_TxErrorCntGet(void);

    //<< void CAN_TTCAN_Enable(void);
    //<< void CAN_TTCAN_Disable(void);
    //<< void CAN_TTCAN_IrqCmd(void);
    //<< void CAN_TTCAN_ReferenceMsgSet(stc_can_ttcan_ref_msg_t *pstcRefMsg);
    //<< void CAN_TTCAN_TriggerConfig(stc_can_ttcan_trigger_config_t *pstcTriggerCfg);

    //@} // CanGroup

#ifdef __cplusplus
}
#endif

#endif /* DDL_CAN_ENABLE */

#endif /* __HC32F46X_CAN_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
